Mrklly/source/ir_repeater/stdlib/src/hc32_bt.c
    pstcM0PBt->ICLR_f.UIF  = 0;
    pstcM0PBt->ICLR_f.CA0F = 0;
    pstcM0PBt->ICLR_f.CB0F = 0;
    pstcM0PBt->ICLR_f.BIF  = 0;
    pstcM0PBt->ICLR_f.TIF  = 0;
    pstcM0PBt->ICLR_f.CA0E = 0;
    pstcM0PBt->ICLR_f.CB0E = 0;


    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 中断使能(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode0_EnableIrq(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE0_TypeDef *pstcM0PBt = (M0P_TIM0_MODE0_TypeDef *)((uint32_t)M0P_TIM0_MODE0+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M0CR_f.UIE = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 中断禁止(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode0_DisableIrq(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE0_TypeDef *pstcM0PBt = (M0P_TIM0_MODE0_TypeDef *)((uint32_t)M0P_TIM0_MODE0+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M0CR_f.UIE = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 中断使能(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  enTim3Irq        中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode1_EnableIrq (en_bt_unit_t enUnit, en_bt_irq_type_t enBtIrq)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE1_TypeDef *pstcM0PBt = (M0P_TIM0_MODE1_TypeDef *)((uint32_t)M0P_TIM0_MODE1+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    switch (enBtIrq)
    {
        case BtUevIrq:
            pstcM0PBt->M1CR_f.UIE = TRUE;
            break;
        case BtCA0Irq:
            pstcM0PBt->CR0_f.CIEA = TRUE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 中断禁止(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  enTim3Irq        中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode1_DisableIrq (en_bt_unit_t enUnit, en_bt_irq_type_t enBtIrq)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE1_TypeDef *pstcM0PBt = (M0P_TIM0_MODE1_TypeDef *)((uint32_t)M0P_TIM0_MODE1+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));


    switch (enBtIrq)
    {
        case BtUevIrq:
            pstcM0PBt->M1CR_f.UIE = FALSE;
            break;
        case BtCA0Irq:
            pstcM0PBt->CR0_f.CIEA = FALSE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 中断使能(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
  ** \param [in]  enTim3Irq       中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode23_EnableIrq (en_bt_unit_t enUnit, en_bt_irq_type_t enBtIrq)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));


    switch (enBtIrq)
    {
        case BtUevIrq:
            pstcM0PBt->M23CR_f.UIE = TRUE;
            break;
        case BtCA0Irq:
            pstcM0PBt->CRCH0_f.CIEA = TRUE;
            break;
        case BtCB0Irq:
            pstcM0PBt->CRCH0_f.CIEB = TRUE;
            break;
        case BtBkIrq:
            pstcM0PBt->M23CR_f.BIE = TRUE;
            break;
        case BtTrigIrq:
            pstcM0PBt->M23CR_f.TIE = TRUE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 中断禁止(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  enTim3Irq        中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode23_DisableIrq (en_bt_unit_t enUnit, en_bt_irq_type_t enBtIrq)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));


    switch (enBtIrq)
    {
        case BtUevIrq:
            pstcM0PBt->M23CR_f.UIE = FALSE;
            break;
        case BtCA0Irq:
            pstcM0PBt->CRCH0_f.CIEA = FALSE;
            break;
        case BtCB0Irq:
            pstcM0PBt->CRCH0_f.CIEB = FALSE;
            break;
        case BtBkIrq:
            pstcM0PBt->M23CR_f.BIE = FALSE;
            break;
        case BtTrigIrq:
            pstcM0PBt->M23CR_f.TIE = FALSE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 中断服务函数
 **
 **
 ** \param [in]  u8Param           Timer通道选择（0 - TIM0、1 - TIM1、2 - TIM2）
 **
 ** \retval NULL
 *****************************************************************************/
void Tim_IRQHandler(uint8_t u8Param)
{
    switch (u8Param)
    {
        case 0:
            if(NULL != pfnTim0Callback)
            {
                pfnTim0Callback();
            }
            break;
        case 1:
            if(NULL != pfnTim1Callback)
            {
                pfnTim1Callback();
            }
            break;
        case 2:
            if(NULL != pfnTim2Callback)
            {
                pfnTim2Callback();
            }
            break;
        default:
            ;
            break;
    }
}



/**
 *****************************************************************************
 ** \brief Base Timer 初始化配置(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode0_Init(en_bt_unit_t enUnit, stc_bt_mode0_config_t* pstcConfig)
{
    en_result_t enResult = Ok;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            {
                M0P_TIM0_MODE0->M0CR_f.MODE   = pstcConfig->enWorkMode;
                M0P_TIM0_MODE0->M0CR_f.GATEP  = pstcConfig->enGateP;
                M0P_TIM0_MODE0->M0CR_f.GATE   = pstcConfig->bEnGate;
                M0P_TIM0_MODE0->M0CR_f.PRS    = pstcConfig->enPRS;
                M0P_TIM0_MODE0->M0CR_f.TOGEN  = pstcConfig->bEnTog;
                M0P_TIM0_MODE0->M0CR_f.CT     = pstcConfig->enCT;
                M0P_TIM0_MODE0->M0CR_f.MD     = pstcConfig->enCntMode;

                pfnTim0Callback      = pstcConfig->pfnTim0Cb;
            }
            break;
        case TIM1:
            {
                M0P_TIM1_MODE0->M0CR_f.MODE   = pstcConfig->enWorkMode;
                M0P_TIM1_MODE0->M0CR_f.GATEP  = pstcConfig->enGateP;
                M0P_TIM1_MODE0->M0CR_f.GATE   = pstcConfig->bEnGate;
                M0P_TIM1_MODE0->M0CR_f.PRS    = pstcConfig->enPRS;
                M0P_TIM1_MODE0->M0CR_f.TOGEN  = pstcConfig->bEnTog;
                M0P_TIM1_MODE0->M0CR_f.CT     = pstcConfig->enCT;
                M0P_TIM1_MODE0->M0CR_f.MD     = pstcConfig->enCntMode;

                pfnTim1Callback      = pstcConfig->pfnTim1Cb;
            }
            break;
        case TIM2:
            {
                M0P_TIM2_MODE0->M0CR_f.MODE   = pstcConfig->enWorkMode;
                M0P_TIM2_MODE0->M0CR_f.GATEP  = pstcConfig->enGateP;
                M0P_TIM2_MODE0->M0CR_f.GATE   = pstcConfig->bEnGate;
                M0P_TIM2_MODE0->M0CR_f.PRS    = pstcConfig->enPRS;
                M0P_TIM2_MODE0->M0CR_f.TOGEN  = pstcConfig->bEnTog;
                M0P_TIM2_MODE0->M0CR_f.CT     = pstcConfig->enCT;
                M0P_TIM2_MODE0->M0CR_f.MD     = pstcConfig->enCntMode;

                pfnTim2Callback      = pstcConfig->pfnTim2Cb;

