Mrklly/source/ir_repeater/stdlib/src/hc32_bt.c
            }
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 启动运行(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M0_Run(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE0_TypeDef *pstcM0PBt = (M0P_TIM0_MODE0_TypeDef *)((uint32_t)M0P_TIM0_MODE0+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M0CR_f.CTEN = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 停止运行(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M0_Stop(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE0_TypeDef *pstcM0PBt = (M0P_TIM0_MODE0_TypeDef *)((uint32_t)M0P_TIM0_MODE0+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M0CR_f.CTEN = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 翻转输出使能/禁止设定(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  bEnOutput        翻转输出设定 TRUE:使能, FALSE:禁止
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M0_EnTOG_Output(en_bt_unit_t enUnit, boolean_t bEnOutput)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE0_TypeDef *pstcM0PBt = (M0P_TIM0_MODE0_TypeDef *)((uint32_t)M0P_TIM0_MODE0+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->DTR_f.MOE = bEnOutput;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 16位计数器初值设置(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  u16Data          16位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M0_Cnt16Set(en_bt_unit_t enUnit, uint16_t u16Data)
{
    en_result_t enResult = Ok;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            M0P_TIM0_MODE0->CNT_f.CNT = u16Data;
            break;
        case TIM1:
            M0P_TIM1_MODE0->CNT_f.CNT = u16Data;
            break;
        case TIM2:
            M0P_TIM2_MODE0->CNT_f.CNT = u16Data;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 16位计数值获取(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval 16bits计数值
 *****************************************************************************/
uint16_t Bt_M0_Cnt16Get(en_bt_unit_t enUnit)
{
    uint16_t    u16CntData = 0;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            u16CntData = M0P_TIM0_MODE0->CNT_f.CNT;
            break;
        case TIM1:
            u16CntData = M0P_TIM1_MODE0->CNT_f.CNT;
            break;
        case TIM2:
            u16CntData = M0P_TIM2_MODE0->CNT_f.CNT;
            break;
        default:
            u16CntData = 0;
            break;
    }

    return u16CntData;
}

/**
 *****************************************************************************
 ** \brief Base Timer 重载值设置(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  u16Data          16bits重载值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M0_ARRSet(en_bt_unit_t enUnit, uint16_t u16Data)
{
    en_result_t enResult = Ok;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            M0P_TIM0_MODE0->ARR_f.ARR = u16Data;
            break;
        case TIM1:
            M0P_TIM1_MODE0->ARR_f.ARR = u16Data;
            break;
        case TIM2:
            M0P_TIM2_MODE0->ARR_f.ARR = u16Data;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 32位计数器初值设置(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  u32Data          32位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M0_Cnt32Set(en_bt_unit_t enUnit, uint32_t u32Data)
{
    en_result_t enResult = Ok;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            M0P_TIM0_MODE0->CNT32_f.CNT32 = u32Data;
            break;
        case TIM1:
            M0P_TIM1_MODE0->CNT32_f.CNT32 = u32Data;
            break;
        case TIM2:
            M0P_TIM2_MODE0->CNT32_f.CNT32 = u32Data;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 32位计数值获取(模式0)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval 32bits计数值
 *****************************************************************************/
uint32_t Bt_M0_Cnt32Get(en_bt_unit_t enUnit)
{
    uint32_t    u32CntData = 0;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            u32CntData = M0P_TIM0_MODE0->CNT32_f.CNT32;
            break;
        case TIM1:
            u32CntData = M0P_TIM1_MODE0->CNT32_f.CNT32;
            break;
        case TIM2:
            u32CntData = M0P_TIM2_MODE0->CNT32_f.CNT32;
            break;
        default:
            u32CntData = 0;
            break;
    }

    return u32CntData;
}

/**
 *****************************************************************************
 ** \brief Base Timer 初始化配置(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode1_Init(en_bt_unit_t enUnit, stc_bt_mode1_config_t* pstcConfig)
{
    en_result_t enResult = Ok;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            {
                M0P_TIM0_MODE1->M1CR_f.MODE    = pstcConfig->enWorkMode;
                M0P_TIM0_MODE1->M1CR_f.PRS     = pstcConfig->enPRS;
                M0P_TIM0_MODE1->M1CR_f.CT      = pstcConfig->enCT;
                M0P_TIM0_MODE1->M1CR_f.ONESHOT = pstcConfig->enOneShot;

                pfnTim0Callback      = pstcConfig->pfnTim0Cb;
            }
            break;
        case TIM1:
            {
                M0P_TIM1_MODE1->M1CR_f.MODE    = pstcConfig->enWorkMode;
                M0P_TIM1_MODE1->M1CR_f.PRS     = pstcConfig->enPRS;
                M0P_TIM1_MODE1->M1CR_f.CT      = pstcConfig->enCT;
                M0P_TIM1_MODE1->M1CR_f.ONESHOT = pstcConfig->enOneShot;

                pfnTim1Callback      = pstcConfig->pfnTim1Cb;
            }
            break;
        case TIM2:
            {
                M0P_TIM2_MODE1->M1CR_f.MODE    = pstcConfig->enWorkMode;
                M0P_TIM2_MODE1->M1CR_f.PRS     = pstcConfig->enPRS;
                M0P_TIM2_MODE1->M1CR_f.CT      = pstcConfig->enCT;
                M0P_TIM2_MODE1->M1CR_f.ONESHOT = pstcConfig->enOneShot;

                pfnTim2Callback      = pstcConfig->pfnTim2Cb;
            }
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer PWC 输入配置(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M1_Input_Config(en_bt_unit_t enUnit, stc_bt_pwc_input_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE1_TypeDef *pstcM0PBt = (M0P_TIM0_MODE1_TypeDef *)((uint32_t)M0P_TIM0_MODE1+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

