Mrklly/source/ir_repeater/stdlib/src/hc32_bt.c
    pstcM0PBt->MSCR_f.TS    = pstcConfig->enTsSel;
    pstcM0PBt->MSCR_f.IA0S  = pstcConfig->enIA0Sel;
    pstcM0PBt->MSCR_f.IB0S  = pstcConfig->enIB0Sel;
    pstcM0PBt->FLTR_f.ETP   = pstcConfig->enETRPhase;
    pstcM0PBt->FLTR_f.FLTET = pstcConfig->enFltETR;
    pstcM0PBt->FLTR_f.FLTA0 = pstcConfig->enFltIA0;
    pstcM0PBt->FLTR_f.FLTB0 = pstcConfig->enFltIB0;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer PWC测量边沿起始结束选择(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  enEdgeSel        pwc测量起始终止电平
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M1_PWC_Edge_Sel(en_bt_unit_t enUnit,en_bt_m1cr_Edge_t enEdgeSel)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE1_TypeDef *pstcM0PBt = (M0P_TIM0_MODE1_TypeDef *)((uint32_t)M0P_TIM0_MODE1+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    switch (enEdgeSel)
    {
        case 0:                            ///< 上升沿到上升沿(周期)
            pstcM0PBt->M1CR_f.EDG1ST = 0;  //上升沿
            pstcM0PBt->M1CR_f.EDG2ND = 0;  //上升沿
            break;
        case 1:                            ///< 下降沿到上升沿(低电平)
            pstcM0PBt->M1CR_f.EDG1ST = 1;  //下降沿
            pstcM0PBt->M1CR_f.EDG2ND = 0;  //上升沿
            break;
        case 2:                            ///< 上升沿到下降沿(高电平)
            pstcM0PBt->M1CR_f.EDG1ST = 0;  //上升沿
            pstcM0PBt->M1CR_f.EDG2ND = 1;  //下降沿
            break;
        case 3:                            ///< 下降沿到下降沿(周期)
            pstcM0PBt->M1CR_f.EDG1ST = 1;  //下降沿
            pstcM0PBt->M1CR_f.EDG2ND = 1;  //下降沿
            break;
        default:
            ;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 启动运行(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M1_Run(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE1_TypeDef *pstcM0PBt = (M0P_TIM0_MODE1_TypeDef *)((uint32_t)M0P_TIM0_MODE1+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M1CR_f.CTEN = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 停止运行(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M1_Stop(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE1_TypeDef *pstcM0PBt = (M0P_TIM0_MODE1_TypeDef *)((uint32_t)M0P_TIM0_MODE1+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M1CR_f.CTEN = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 16位计数器初值设置(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  u16Data          16位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M1_Cnt16Set(en_bt_unit_t enUnit, uint16_t u16Data)
{
    en_result_t enResult = Ok;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            M0P_TIM0_MODE1->CNT_f.CNT = u16Data;
            break;
        case TIM1:
            M0P_TIM1_MODE1->CNT_f.CNT = u16Data;
            break;
        case TIM2:
            M0P_TIM2_MODE1->CNT_f.CNT = u16Data;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 16位计数值获取(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval 16bits计数值
 *****************************************************************************/
uint16_t Bt_M1_Cnt16Get(en_bt_unit_t enUnit)
{
    uint16_t    u16CntData = 0;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            u16CntData = M0P_TIM0_MODE1->CNT_f.CNT;
            break;
        case TIM1:
            u16CntData = M0P_TIM1_MODE1->CNT_f.CNT;
            break;
        case TIM2:
            u16CntData = M0P_TIM2_MODE1->CNT_f.CNT;
            break;
        default:
            u16CntData = 0;
            break;
    }

    return u16CntData;
}

/**
 *****************************************************************************
 ** \brief Base Timer 脉冲宽度测量结果数值获取(模式1)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval 16bits脉冲宽度测量结果
 *****************************************************************************/
uint16_t Bt_M1_PWC_CapValueGet(en_bt_unit_t enUnit)
{
    uint16_t    u16CapData = 0;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            u16CapData = M0P_TIM0_MODE1->CCR0A_f.CCR0A;
            break;
        case TIM1:
            u16CapData = M0P_TIM1_MODE1->CCR0A_f.CCR0A;
            break;
        case TIM2:
            u16CapData = M0P_TIM2_MODE1->CCR0A_f.CCR0A;
            break;
        default:
            u16CapData = 0;
            break;
    }

    return u16CapData;
}

/**
 *****************************************************************************
 ** \brief Base Timer 初始化配置(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_Mode23_Init(en_bt_unit_t enUnit, stc_bt_mode23_config_t* pstcConfig)
{
    en_result_t enResult = Ok;

    ASSERT(IS_VALID_TIM(enUnit));

    switch (enUnit)
    {
        case TIM0:
            {
                M0P_TIM0_MODE23->M23CR_f.MODE    = pstcConfig->enWorkMode;

                M0P_TIM0_MODE23->M23CR_f.PRS     = pstcConfig->enPRS;
                M0P_TIM0_MODE23->M23CR_f.CT      = pstcConfig->enCT;
                M0P_TIM0_MODE23->M23CR_f.COMP    = pstcConfig->enPWMTypeSel;
                M0P_TIM0_MODE23->M23CR_f.PWM2S   = pstcConfig->enPWM2sSel;
                M0P_TIM0_MODE23->M23CR_f.ONESHOT = pstcConfig->bOneShot;
                M0P_TIM0_MODE23->M23CR_f.URS     = pstcConfig->bURSSel;
                M0P_TIM0_MODE23->M23CR_f.DIR     = pstcConfig->enCntDir;

                pfnTim0Callback      = pstcConfig->pfnTim0Cb;
            }
            break;
        case TIM1:
            {
                M0P_TIM1_MODE23->M23CR_f.MODE    = pstcConfig->enWorkMode;

