Mrklly/source/ir_repeater/stdlib/src/hc32_bt.c
                M0P_TIM1_MODE23->M23CR_f.PRS     = pstcConfig->enPRS;
                M0P_TIM1_MODE23->M23CR_f.CT      = pstcConfig->enCT;
                M0P_TIM1_MODE23->M23CR_f.COMP    = pstcConfig->enPWMTypeSel;
                M0P_TIM1_MODE23->M23CR_f.PWM2S   = pstcConfig->enPWM2sSel;
                M0P_TIM1_MODE23->M23CR_f.ONESHOT = pstcConfig->bOneShot;
                M0P_TIM1_MODE23->M23CR_f.URS     = pstcConfig->bURSSel;
                M0P_TIM1_MODE23->M23CR_f.DIR     = pstcConfig->enCntDir;

                pfnTim1Callback      = pstcConfig->pfnTim1Cb;
            }
            break;
        case TIM2:
            {
                M0P_TIM2_MODE23->M23CR_f.MODE    = pstcConfig->enWorkMode;

                M0P_TIM2_MODE23->M23CR_f.PRS     = pstcConfig->enPRS;
                M0P_TIM2_MODE23->M23CR_f.CT      = pstcConfig->enCT;
                M0P_TIM2_MODE23->M23CR_f.COMP    = pstcConfig->enPWMTypeSel;
                M0P_TIM2_MODE23->M23CR_f.PWM2S   = pstcConfig->enPWM2sSel;
                M0P_TIM2_MODE23->M23CR_f.ONESHOT = pstcConfig->bOneShot;
                M0P_TIM2_MODE23->M23CR_f.URS     = pstcConfig->bURSSel;
                M0P_TIM2_MODE23->M23CR_f.DIR     = pstcConfig->enCntDir;

                pfnTim2Callback      = pstcConfig->pfnTim2Cb;
            }
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer PWM输出使能/禁止(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  bEnOutput        PWM输出使能/禁止设定
 ** \param [in]  bEnAutoOutput    PWM自动输出使能/禁止设定
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_EnPWM_Output(en_bt_unit_t enUnit, boolean_t bEnOutput, boolean_t bEnAutoOutput)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->DTR_f.MOE = bEnOutput;
    pstcM0PBt->DTR_f.AOE = bEnAutoOutput;

    return enResult;
}


/**
 *****************************************************************************
 ** \brief Base Timer 启动运行(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_Run(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.CTEN = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 停止运行(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_Stop(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.CTEN = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 重载值设置(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  u16Data          16bits重载值
 ** \param [in]  bArrBufEn        ARR重载缓存使能TRUE/禁止FALSE
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_ARRSet(en_bt_unit_t enUnit, uint16_t u16Data, boolean_t bArrBufEn)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

     pstcM0PBt->ARR_f.ARR = u16Data;
     pstcM0PBt->M23CR_f.BUFPEN  = bArrBufEn;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 16位计数器初值设置(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  u16Data          16位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_Cnt16Set(en_bt_unit_t enUnit, uint16_t u16Data)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->CNT_f.CNT       = u16Data;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 16位计数值获取(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval 16bits计数值
 *****************************************************************************/
uint16_t Bt_M23_Cnt16Get(en_bt_unit_t enUnit)
{
    uint16_t    u16CntData = 0;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    u16CntData = pstcM0PBt->CNT_f.CNT;

    return u16CntData;
}

/**
 *****************************************************************************
 ** \brief Base Timer 比较捕获寄存器CCR0A/CCR0B设置(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  enCCRSel         CCR0A/CCR0B设定
 ** \param [in]  u16Data          CCR0A/CCR0B 16位初始值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_CCR_Set(en_bt_unit_t enUnit, en_bt_m23_ccrx_t enCCRSel, uint16_t u16Data)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    if(BtCCR0A == enCCRSel)
    {
        pstcM0PBt->CCR0A_f.CCR0A = u16Data;
    }
    else if(BtCCR0B == enCCRSel)
    {
        pstcM0PBt->CCR0B_f.CCR0B = u16Data;
    }
    else
    {
        enResult = Error;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 比较捕获寄存器CCR0A/CCR0B读取(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  enCCRSel         CCR0A/CCR0B设定
 **
 ** \retval 16bitsCCR0A捕获值
 *****************************************************************************/
uint16_t Bt_M23_CCR_Get(en_bt_unit_t enUnit, en_bt_m23_ccrx_t enCCRSel)
{
    uint16_t    u16Data = 0;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    if(BtCCR0A == enCCRSel)
    {
        u16Data = pstcM0PBt->CCR0A_f.CCR0A;
    }
    else if(BtCCR0B == enCCRSel)
    {
        u16Data = pstcM0PBt->CCR0B_f.CCR0B;
    }
    else
    {
        u16Data = 0;
    }

    return u16Data;
}

/**
 *****************************************************************************
 ** \brief Base Timer PWM互补输出模式下，GATE功能选择(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_GateFuncSel(en_bt_unit_t enUnit,stc_bt_m23_gate_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.CSG = pstcConfig->enGateFuncSel;
    pstcM0PBt->M23CR_f.CRG = pstcConfig->bGateRiseCap;
    pstcM0PBt->M23CR_f.CFG = pstcConfig->bGateFallCap;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 主从模式配置(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_MasterSlave_Set(en_bt_unit_t enUnit, stc_bt_m23_master_slave_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->MSCR_f.MSM = pstcConfig->enMasterSlaveSel;
    pstcM0PBt->MSCR_f.MMS = pstcConfig->enMasterSrc;
    pstcM0PBt->MSCR_f.SMS = pstcConfig->enSlaveModeSel;
    pstcM0PBt->MSCR_f.TS  = pstcConfig->enTsSel;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer CH0A/CH0B比较通道输出控制(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_PortOutput_Config(en_bt_unit_t enUnit, stc_bt_m23_compare_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

