Mrklly/source/ir_repeater/stdlib/src/hc32_bt.c
    pstcM0PBt->CRCH0_f.CSA         = 0;
    pstcM0PBt->FLTR_f.OCMA0_FLTA0  = pstcConfig->enCH0ACmpCtrl;
    pstcM0PBt->FLTR_f.CCPA0        = pstcConfig->enCH0APolarity;
    pstcM0PBt->CRCH0_f.BUFEA       = pstcConfig->bCh0ACmpBufEn;
    pstcM0PBt->M23CR_f.CIS         = pstcConfig->enCh0ACmpIntSel;

    pstcM0PBt->CRCH0_f.CSB         = 0;
    pstcM0PBt->FLTR_f.OCMB0_FLTB0  = pstcConfig->enCH0BCmpCtrl;
    pstcM0PBt->FLTR_f.CCPB0        = pstcConfig->enCH0BPolarity;
    pstcM0PBt->CRCH0_f.BUFEB       = pstcConfig->bCH0BCmpBufEn;
    pstcM0PBt->CRCH0_f.CISB        = pstcConfig->enCH0BCmpIntSel;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer CH0A/CH0B输入控制(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_PortInput_Config(en_bt_unit_t enUnit, stc_bt_m23_input_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->CRCH0_f.CSA           = 1;
    pstcM0PBt->CRCH0_f.CFA_CRA_BKSA  = pstcConfig->enCH0ACapSel;
    pstcM0PBt->FLTR_f.OCMA0_FLTA0    = pstcConfig->enCH0AInFlt;
    pstcM0PBt->FLTR_f.CCPA0          = pstcConfig->enCH0APolarity;

    pstcM0PBt->CRCH0_f.CSB           = 1;
    pstcM0PBt->CRCH0_f.CFB_CRB_BKSB  = pstcConfig->enCH0BCapSel;
    pstcM0PBt->FLTR_f.OCMB0_FLTB0    = pstcConfig->enCH0BInFlt;
    pstcM0PBt->FLTR_f.CCPB0          = pstcConfig->enCH0BPolarity;

    return enResult;
}

void Bt_M23_CapEdge_Config(en_bt_unit_t enUnit, en_bt_m23_crch0_cfx_crx_t edge)
{
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->CRCH0_f.CSA           = 1;
    pstcM0PBt->CRCH0_f.CFA_CRA_BKSA  = edge;
}


/**
 *****************************************************************************
 ** \brief Base Timer ERT输入控制(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_ETRInput_Config(en_bt_unit_t enUnit, stc_bt_m23_etr_input_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->FLTR_f.ETP    = pstcConfig->enETRPolarity;
    pstcM0PBt->FLTR_f.FLTET  = pstcConfig->enETRFlt;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 刹车BK输入控制(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_BrakeInput_Config(en_bt_unit_t enUnit, stc_bt_m23_bk_input_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->DTR_f.BKE             = pstcConfig->bEnBrake;
    pstcM0PBt->DTR_f.VC0E            = pstcConfig->bEnVC0Brake;
    pstcM0PBt->DTR_f.VC1E            = pstcConfig->bEnVC1Brake;
    pstcM0PBt->DTR_f.SAFEEN          = pstcConfig->bEnSafetyBk;
    pstcM0PBt->DTR_f.BKSEL           = pstcConfig->bEnBKSync;
    pstcM0PBt->CRCH0_f.CFA_CRA_BKSA  = pstcConfig->enBkCH0AStat;
    pstcM0PBt->CRCH0_f.CFB_CRB_BKSB  = pstcConfig->enBkCH0BStat;
    pstcM0PBt->FLTR_f.BKP            = pstcConfig->enBrakePolarity;
    pstcM0PBt->FLTR_f.FLTBK          = pstcConfig->enBrakeFlt;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 触发ADC控制(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_TrigADC_Config(en_bt_unit_t enUnit, stc_bt_m23_adc_trig_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->ADTR_f.ADTE   = pstcConfig->bEnTrigADC;
    pstcM0PBt->ADTR_f.UEVE   = pstcConfig->bEnUevTrigADC;
    pstcM0PBt->ADTR_f.CMA0E  = pstcConfig->bEnCH0ACmpTrigADC;
    pstcM0PBt->ADTR_f.CMB0E  = pstcConfig->bEnCH0BCmpTrigADC;

    return enResult;
}

/**
 *****************************************************************************
** \brief Base Timer 死区功能(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_DT_Config(en_bt_unit_t enUnit, stc_bt_m23_dt_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->DTR_f.DTEN = pstcConfig->bEnDeadTime;
    pstcM0PBt->DTR_f.DTR  = pstcConfig->u8DeadTimeValue;

    return enResult;
}

/**
 *****************************************************************************
** \brief Base Timer 重复周期设置(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  u8ValidPeriod    重复周期值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_SetValidPeriod(en_bt_unit_t enUnit, uint8_t u8ValidPeriod)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

