Mrklly/source/ir_repeater/stdlib/src/hc32_bt.c
    pstcM0PBt->RCR_f.RCR = u8ValidPeriod;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer OCREF清除功能(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_OCRefClr(en_bt_unit_t enUnit, stc_bt_m23_OCREF_Clr_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.OCCS = pstcConfig->enOCRefClrSrcSel;
    pstcM0PBt->M23CR_f.OCCE = pstcConfig->bVCClrEn;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 使能DMA传输(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 ** \param [in]  pstcConfig       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_EnDMA(en_bt_unit_t enUnit, stc_bt_m23_trig_dma_config_t* pstcConfig)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.UDE  = pstcConfig->bUevTrigDMA;
    pstcM0PBt->M23CR_f.TDE  = pstcConfig->bTITrigDMA;
    pstcM0PBt->CRCH0_f.CDEA = pstcConfig->bCmpATrigDMA;
    pstcM0PBt->CRCH0_f.CDEB = pstcConfig->bCmpBTrigDMA;
    pstcM0PBt->MSCR_f.CCDS  = pstcConfig->enCmpUevTrigDMA;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 捕获比较A软件触发(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_EnSwTrigCapCmpA(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;

    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);

    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->CRCH0_f.CCGA = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 捕获比较B软件触发(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_EnSwTrigCapCmpB(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;

    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);

    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->CRCH0_f.CCGB = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 软件更新使能(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_EnSwUev(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.UG = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 软件触发使能(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_EnSwTrig(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.TG = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Base Timer 软件刹车使能(模式23)
 **
 **
 ** \param [in]  enUnit           Timer通道选择（TIM0、TIM1、TIM2）
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Bt_M23_EnSwBk(en_bt_unit_t enUnit)
{
    en_result_t enResult = Ok;
    volatile M0P_TIM0_MODE23_TypeDef *pstcM0PBt = (M0P_TIM0_MODE23_TypeDef *)((uint32_t)M0P_TIM0_MODE23+0x100*enUnit);
    ASSERT(IS_VALID_TIM(enUnit));

    pstcM0PBt->M23CR_f.BG = TRUE;

    return enResult;
}

//@} // BtGroup

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
